# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'antigen'
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-flow-avh'
brew 'gnupg'
brew 'grep'
brew 'htop-osx'
brew 'httpie'
brew 'imapsync'
brew 'jq'
brew 'mackup'
brew 'mas'
brew 'nmap'
brew 'pkg-config'
brew 'svn' # needed for fonts
brew 'tree'
brew 'zsh'

# Development
brew 'php'
brew 'php@8.1'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'appcleaner'
cask 'autodesk-fusion360'
cask 'balenaetcher'
cask 'bartender'
cask 'camtasia'
cask 'cleanshot'
cask 'deepl'
cask 'dropbox'
cask 'f-bar'
cask 'figma'
cask 'fork'
cask 'google-chrome'
cask 'gpg-suite'
cask 'grammarly'
cask 'helo'
cask 'homebrew/cask-drivers/elgato-control-center'
cask 'homebrew/cask-drivers/fujitsu-scansnap-manager-ix500'
cask 'imageoptim'
cask 'iterm2'
cask 'mactracker'
cask 'moneymoney'
cask 'notion'
cask 'paw'
cask 'phpmon'
cask 'phpstorm'
cask 'prusaslicer'
cask 'rectangle'
cask 'raycast'
cask 'shapr3d'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'teamviewer'
cask 'telegram'
cask 'tinkerwell'
cask 'todoist'
cask 'transmit'
cask 'tuple'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-comfortaa'
cask 'font-fira-code'
cask 'font-fira-mono-for-powerline'
cask 'font-jetbrains-mono'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Affinity Publisher', id: 881418622
mas 'Bear', id: 1091189122
mas 'Keynote', id: 409183694
mas 'Lanscan', id: 472226235
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
